app/views/posts/show.html.erb

  <h3>Tags:</h3>
  <% @post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = ?  [["post_id", 3]]